Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_educational_supports/national_educational_psychological_service.html.txt.tmx
Source language: en
Languages: ga

source: Psychological services for schools
ga: Seirbhís síceolaíochta i scoileanna

source: The National Educational Psychological Service (NEPS) provides psychological services in public and private primary and post-primary schools and in related educational centres
ga: Soláthraíonn an tSeirbhís Náisiúnta Síceolaíochta Oideachais (SNSO) seirbhísí síceolaíochta i mbunscoileanna agus iar-bhunscoileanna poiblí agus príobháideacha in Éirinn agus in ionaid oideachais ghaolmhara

source: NEPS is a service of the Department of Education and Skills (DES) and aims to support the personal, social and educational development of all children through the application of psychological theory and practice in education
ga: Is seirbhís í an SNSO faoin Roinn Oideachais agus Scileanna agus is í a cuspóir ná tacú le forbairt phearsanta, shóisialta agus oideachais gach linbh trí chleachtas agus theoiric shiceolaíochta a chur i bhfeidhm san oideachas

source: It has particular regard for children with special educational needs
ga: Tugann an tSeirbhís aird ar leith ar leanaí a bhfuil riachtanais speisialta oideachais acu

source: You can read further information about how NEPS services are operated in the booklet Working Together to Make a Difference to Children (pdf) on the DES website
ga: Tá tuilleadh eolais faoi reáchtáil seirbhísí SNSO sa leabhrán Ag Obair le Chéile ar Mhaithe le Leanaí (pdf) ar an suíomh gréasaín ROE

source: The psychologists employed by NEPS are located in 8 regions throughout the country
ga: Tá na síceolaithe a fhostaíonn SNSO lonnaithe i 8 n-áit timpeall na tíre

source: They work directly with a number of schools and their work includes:
ga: Oibríonn siad go díreach le roinnt scoileanna agus i measc a gcuid oibre tá:

source: • Engaging in individual casework with children and young people
ga: • Obair a dhéanamh de réir cáis le leanaí agus daoine óga aonair

source: • Providing a consultation service for teachers and parents
ga: • Seirbhís chomhairliúcháin a sholáthar do mhúinteoirí agus thuismitheoirí

source: • Participating in school-based projects relevant to educational psychology
ga: • Bheith páirteach i dtionscnaimh scoile a bhaineann le síceolaíocht oideachais

source: • Promoting mental health in schools
ga: • Sláinte intinne a chur chun cinn i scoileanna

source: Scheme for Commissioning Psychological Assessments
ga: Sceim le Measúnuithe Pearsanta Síceolaíochta a Ordú (SMPS)

source: Schools which do not have a service from NEPS can use the Scheme for Commissioning Psychological Assessment (SCPA)
ga: Is féidir le scoileanna atá gan SNSO faoi láthair leas a bhaint as an Scéim le Measúnuithe Pearsanta Síceolaíochta a Ordú (SMPS)

source: This is an interim measure funding schools to meet the urgent needs for psychological advice while the NEPS service is being expanded to all schools
ga: Is idirbheart í an scéim sin a chuireann maoiniú ar fáil do scoileanna le riachtanais phráinneacha ar chomhairle Síceolaíochta, fad is atá seirbhísí SNSO á leathnú chuig na scoileanna ar fad

source: Only psychologists listed in the current SCPA Panel 2014-2015 (pdf) are eligible to carry out work under the SCPA scheme
ga: Níl ach síceolaithe atá liostaithe i bPainéal reatha an SCPA 2014-2015 (pdf) i dteideal tabhairt faoi obair faoi scéim an SCPA

source: Further information on the Scheme for Commissioning Psychological Assessment (SCPA) is available
ga: Tá níos mó eolais ar an Scéim le Measúnuithe Pearsanta Síceolaíochta a Ordú ar fáil anseo

source: How should children be selected for individual psychological assessment?
ga: Cén chaoi gur cheart leanaí a roghnú le measúnú pearsanta síceolaíochta?

source: In general, teachers will have noticed those children who have difficulty in coping with the normal curriculum
ga: Is iondúil go bhfuil sé tugtha faoi deara ag na múnteoirí go bhfuil deacrachtaí ag na leanaí sin leis an ngnáth-churaclam a leanúint

source: Parents should be made aware of any difficulties being experienced by their child in school, long before there is any question of a psychological assessment
ga: Ba cheart aon deacrachtaí atá ag leanbh a chur in iúl do thuismitheoirí tamall fada sula mbeidh sé i gceist measúnú síceolaíochta a iarraidh do leanbh

source: If required, parents should be encouraged to make arrangements for a check up on the child's general health, hearing and sight
ga: Más gá, ba cheart tuismitheoirí a spreagadh an páiste a thabhairt go dtí an dochtúir lena s(h)láinte ghinearálta, éisteachta agus radharc na súl a scrúdú

source: Before commissioning an individual psychological assessment for a child, school staff should explore the avenue of supplementary teaching
ga: Roimh measúnú pearsanta síceolaíochta a ordú do leanbh, ba cheart d'fhoireann na scoile breathnú ar mhúinteoireacht bhreise mar rogha

source: If the school decides that an assessment is required for a particular child, the principal or a nominated teacher should arrange a personal interview with parents and/or legal guardians
ga: Má dhéanann an scoil an cinneadh go bhfuil gá le measúnú do pháiste faoi leith, ba cheart don phríomhoide nó do mhúinteoir ainmnithe agallamh pearsanta a shocrú leis an thuismitheoirí agus/nó caomhnóirí dlíthiúla

source: The reasons for the assessment should be discussed and each section of the consent form for psychological assessment - form 1 (pdf) explained before parents are asked to sign the form
ga: Ba cheart na cúiseanna a bhaineann leis an measúnú a phlé agus gach cuid denfhoirm cheada le measúnú Síceolaíochta (foirm 1) a shíniú roimh iarraidh ar na tuismitheoirí í a shíniú

source: Psychologists who carry out assessments under this scheme are required to meet the parents
ga: Ní mór do na síceolaithe a dhéanann measúnú faoin scéim seo buaileadh leis na tuismitheoirí

source: They will explain their findings to the parents and will give them a copy of the psychological report
ga: Míneoidh siad torthaí an mheasúnaithe do na tuismitheoirí agus cuirfidh siad cóip den tuairisc shiceolaíochta ar fáil dóibh

source: You can get a NEPS information leaflet for parents (pdf)
ga: Is féidir an bhileog eolais SNSO do thuismitheoirí a íoslódáil anseo

source: The protection of children's interests
ga: Leasa leanaí a chosaint

source: Although this scheme is in place so that children with special learning needs may take advantage of the necessary resources, many children will grow nervous at the thought of meeting a psychologist
ga: Cé go bhfuil an scéim seo ann le go mbeidh leanaí a bhfuil riachtanais speisialta acu in ann tairbhe a bhaint as na hacmhainní cuí, beidh go leor leanaí neirbhíseach má chaitheann siad bualadh le síceolaí

source: It should also be kept in mind that if a child is aware that they have difficulties at school, the prospect of a meeting with a psychologist may confirm to them a perceived weakness
ga: Ba cheart cuimhniú má tá a fhios ag leanaí go bhfuil deacrachtaí acu ar scoil, go bhfuil gach seans ann go gcuirfidh sé sin isteach ar a muinín má chaitheann siad bualadh le síceolaí

source: For this reason, a school should only commission an individual assessment if, having spoken with the child's parents, it is absolutely convinced that the result will benefit the child
ga: Mar sin de, tar éis labhairt le tuismitheoirí an linbh, níor cheart do scoil measúnú Síceolaíochta a ordú ach amháin sa chás go bhfuil siad lán-chinnte gur chun tairbhe an pháiste a bheidh an próiseas seo ar fad

source: NEPS provides advice on whether you should tell your child that his/her learning needs will be assessed by a psychologist
ga: Soláthraíonn NEPS comhairle ar cibé acu ar cheart nó nár cheart duit insint do do leanbh go ndéanfaidh síceolaí measúnú ar a riachtanais foghlama

source: For the protection of the child's confidentiality, he or she is referred to by his or her initials only in all documentation submitted by school authorities to NEPS
ga: Ar mhaithe le rúndacht an linbh a chosaint, baineann údaráis na scoile úsáid as ceannlitreacha a (h)ainm amháin ar gach cáipéis a chuirtear chuir an SNSO

source: All psychologists on the NEPS panel must have obtained Garda clearance
ga: Ní mór do gach síceolaí atá ag plé le SNSO cead an Gharda a bheith faighte acu

source: It is also recommended that a member of the school staff look in on the assessment interview once or twice
ga: Moltar freisin gur cheart do dhuine ar fhoireann na scoile buaileadh isteach sa seomra measúnaithe uair nó dhó le linn an agallaimh

source: In general, an assessment should be carried out in the child's school, where the surroundings are familiar. A separate room in the main building and near the school office is an ideal venue
ga: Go ginearálta, ba cheart an measúnú a dhéanamh i scoil an linbh, mar a bhfuil cur amach aige/aici ar a t(h)impeallacht agus ina mbeidh sé/sí compordach

source: The following may commission psychological assessments under the Scheme for Commissioning Psychological Assessment (SCPA):
ga: Is féidir leis na grúpaí seo a leanas iarratas ar mheasúnuithe síceolaíochta a ordú faoin Scéim le Measúnuithe Pearsanta Síceolaíochta a Ordú (SMPS):

source: • Schools that do not have access to the service provided by NEPS
ga: • Scoileanna nach bhfuil fáil fós acu ar an tseirbhís a chuireann SNSO ar fáil

source: • NEPS Regional Directors who have some additional, but limited, discretion to meet exceptional circumstances arising in their regions
ga: • Tá discréid bhreise, ach teoranta, ag Stiúrthóirí Réigiúnacha SNSO maidir le déileáil le imthosca eisceachtúla a tharlaíonn ina réigiúin

source: Payment by NEPS is made directly to the psychologist
ga: Déanann SNSO íocaíocht go díreach chuig an síceolaí

source: NEPS does not reimburse schools or parents for assessments
ga: Ní aisíocann SNSO scoileanna nó tuismitheoirí as measúnuithe

source: NEPS cannot reimburse you if you are a parent who has commissioned a private psychological assessment
ga: Ní féidir le SNSO tuismitheoir a aisíoc as measúnú a ordú le síceolaí príobháideach

source: 24-27 North Frederick St Dublin 1
ga: Sa chás seo tá faoiseamh cánach le fáil do na híocaíochtaí sin má úsáideann tú Foirm MED 1 (pdf)

source: You can find contact information for the NEPS offices in Ireland (pdf)
ga: Go ginearálta déanann tú iarratas ar sheirbhísí SNSO trí phríomhoide na scoile a bhfuil do leanbh ag freastal uirthi
